In [1]:
%matplotlib inline

import numpy as np
import pandas as pd

df = pd.read_csv("./data-sets/rh-first-lesson.csv")
df.head()

,Years Experience,Employed,Previous employers,Level of Education,Top-tier school,Interned,Hired
0,0,N,0,BS,N,Y,Y
1,2,N,1,BS,Y,Y,N
2,5,Y,2,PHD,Y,N,N
3,1,N,0,BD,Y,N,Y
4,0,Y,0,PHD,N,N,N

In [2]:
df.tail()

,Years Experience,Employed,Previous employers,Level of Education,Top-tier school,Interned,Hired
7,7,N,1,Bs,N,N,Y
8,1,N,0,Bs,N,N,N
9,0,Y,0,Bs,N,N,Y
10,2,N,1,PHD,Y,N,Y
11,3,Y,1,BS,N,Y,Y

In [4]:
df.shape

(12, 7)

In [5]:
df.size

84

In [7]:
len(df)

12

In [8]:
df.columns

Index(['Years Experience', 'Employed', 'Previous employers',
       'Level of Education', 'Top-tier school', 'Interned', 'Hired'],
      dtype='object')